# テキスト情報を管理するファイル

# * Abstract

abstract_list0 = [
    "全て：盛り付けの全体像", "手順①：なすを切って盛り付ける", "手順②：ピーマンを切って盛り付ける", "手順③：エリンギを切って盛り付ける",
]

abstract_list1 = [
    "全て：盛り付けの全体像",
    "サラダ①：コールスロー30gを盛り付ける", "サラダ②：ドレッシングをかける", "サラダ③：ハム2切れをコールスローの上に乗せる", "サラダ④：コーンをスプーン山盛り1杯分コールスローの上に乗せる",
    "おかず：からあげ2つを1分温めて盛り付ける",
    "メイン①：ライス1pcを1分半温めて丸く盛り付ける", "メイン②：揚げなすを2切れを10秒温めてライスに立てかける", "メイン③：カレーソース70gを1分温めてライスにかける", "メイン④：ライスにパセリを振りかける"
]

abstract_list2 = [
    "全て：盛り付けの全体像",
    "サラダ①：リーフミックス30gを盛り付ける", "サラダ②：ドレッシングをかける", "サラダ③：サラダチキン2切れをリーフミックスの上に乗せる", "サラダ④：トマト2切れをリーフミックスの上に乗せる",
    "おかず：からあげ2つを1分温めて盛り付ける",
    "メイン①：パスタ70gをスチーム準備し，4分温めて盛り付ける", "メイン②：ミートソース80gを1分半温めてパスタにかける", "メイン③：ベーコンを4切れを10秒温めてからパスタに乗せる", "メイン④：パスタにパセリを振りかける"
]


# * Detail

detail_list0 = [
    "全て：盛り付けの全体像", "手順①：なすを乱切りにして盛り付ける", "手順②：ピーマンを乱切りにして盛り付ける", "手順③：エリンギを薄切りにして盛り付ける",
]

detail_list1 = [
    "全て：盛り付けの全体像",
    "サラダ①：コールスロー30gを盛り付ける", "サラダ②：ドレッシングをかける", "サラダ③：ハム2切れをコールスローの上に乗せる", "サラダ④：コーンをスプーン山盛り1杯分コールスローの上に乗せる",
    "おかず：からあげ2つを1分温めて盛り付ける",
    "メイン①：ライス1pcを1分半温めて丸く盛り付ける", "メイン②：揚げなすを2切れを10秒温めてライスに立てかける", "メイン③：カレーソース70gを1分温めてライスにかける", "メイン④：ライスにパセリを振りかける"
]

detail_list2 = [
    "全て：盛り付けの全体像",
    "サラダ①：リーフミックス30gを盛り付ける", "サラダ②：ドレッシングをかける", "サラダ③：サラダチキン2切れをリーフミックスの上に乗せる", "サラダ④：トマト2切れをリーフミックスの上に乗せる",
    "おかず：からあげ2つを1分温めて盛り付ける",
    "メイン①：パスタ70gをスチーム準備し，4分温めて盛り付ける", "メイン②：ミートソース80gを1分半温めてパスタにかける", "メイン③：ベーコンを4切れを10秒温めてからパスタに乗せる", "メイン④：パスタにパセリを振りかける"
]