# テキスト情報を管理するファイル

# * Abstract

abstract_list0 = [
    "一通りのレシピ", "手順①：なす，8切れ", "手順②：ピーマン，8切れ", "手順③：エリンギ，8切れ",
]

abstract_list2 = [
    "一通りのレシピ",
    "手順①：コールスロー，30g", "手順②：ドレッシング", "手順③：ハム，2切れ", "手順④：コーン，スプーン山盛り1杯分",
    "手順⑤：からあげ，2つ，1分，",
    "手順⑥：ライス1pc，1分半", "手順⑦：揚げなす，2切れ，10秒", "手順⑧：カレーソース，70g，1分", "手順⑨：パセリ"
]

abstract_list1 = [
    "一通りのレシピ",
    "手順①：リーフミックス，30g", "手順②：ドレッシング", "手順③：サラダチキン，2切れ", "手順④：トマト，2切れ",
    "手順⑤：からあげ，2つ，1分",
    "手順⑥：パスタ，70g，4分", "手順⑦：ミートソース，80g，1分半", "手順⑧：ベーコン，4切れ，10秒", "手順⑨：パセリ"
]


# * Detail

detail_list0 = [
    "一通りのレシピ", "手順①：なすを8切れの乱切りにして盛り付ける", "手順②：ピーマンを8切れの乱切りにして盛り付ける", "手順③：エリンギを8切れの薄切りにして盛り付ける",
]

detail_list2 = [
    "一通りのレシピ",
    "手順①：コールスロー30gを盛り付ける", "手順②：ドレッシングをかける", "手順③：ハム2切れをコールスローの上に乗せる", "手順④：コーンをスプーン山盛り1杯分コールスローの上に乗せる",
    "手順⑤：からあげ2つを1分温めて盛り付ける",
    "手順⑥：ライス1pcを1分半温めて丸く盛り付ける", "手順⑦：揚げなすを2切れを10秒温めてライスに立てかける", "手順⑧：カレーソース70gを1分温めてライスにかける", "手順⑨：ライスにパセリを振りかける"
]

detail_list1 = [
    "盛り付けの全体像",
    "手順①：リーフミックス30gを盛り付ける", "手順②：ドレッシングをかける", "手順③：サラダチキン2切れをリーフミックスの上に乗せる", "手順④：トマト2切れをリーフミックスの上に乗せる",
    "手順⑤：からあげ2つを1分温めて盛り付ける",
    "手順⑥：パスタ70gをスチーム容器に入れて，4分温めて盛り付ける", "手順⑦：ミートソース80gを1分半温めてパスタにかける", "手順⑧：ベーコンを4切れを10秒温めてからパスタに乗せる", "手順⑨：パスタにパセリを振りかける"
]